src/Documents/Scan_ЗапросНаНадстройки/Scan_ЗапросНаНадстройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗапросНаНадстройки</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереданВОтделПланированияПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыУслугиРаботы</name>
    <attributes>
      <name>ТоварУслуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаПродукта</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСпецификацииПоЦС</name>
      <comment>Номер спецификации по ценовому соглашению</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказовНаЗавод</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ЗапросНаНадстройки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Scan_СоглашенияОПоставке") Тогда
		Поставщик           = ДанныеЗаполнения.Кузовостроитель;
		СоглашениеОПоставке = ДанныеЗаполнения.Ссылка;
		
		//ВидВзаимодействияПоставщик = Scan_ПраваИНастройки.Scan_Право("ВидВзаимодействияПоставщик");
		//
		//Запрос = Новый Запрос;
		//Запрос.УстановитьПараметр("Компания",                   ДанныеЗаполнения.Кузовостроитель);
		//Запрос.УстановитьПараметр("ВидВзаимодействияПоставщик", ВидВзаимодействияПоставщик);

		//Запрос.Текст = "ВЫБРАТЬ
		//|	Scan_ВзаимосвязьКомпанийСКонтрагентами.Контрагент КАК Контрагент
		//|ИЗ
		//|	РегистрСведений.Scan_ВзаимосвязьКомпанийСКонтрагентами КАК Scan_ВзаимосвязьКомпанийСКонтрагентами
		//|ГДЕ
		//|	Scan_ВзаимосвязьКомпанийСКонтрагентами.Компания = &Компания
		//|	И Scan_ВзаимосвязьКомпанийСКонтрагентами.ВидВзаимодействия = &ВидВзаимодействияПоставщик";
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//Выборка = РезультатЗапроса.Выбрать();
		//Выборка.Следующий();
		//
		//Поставщик = Выборка.Контрагент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПереданВОтделПланированияПродаж Тогда
		ПроверяемыеРеквизиты.Добавить("Поставщик");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.ТоварУслуга");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.МаркаПродукта");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Количество");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Цена");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Валюта");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.Дилер");
		ПроверяемыеРеквизиты.Добавить("ТоварыУслугиРаботы.НомераЗаказов");
	КонецЕсли;
	
КонецПроцедуры
